Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services_for_people_with_disabilities/health_services_for_people_with_intellectual_physical_or_sensory_disabilities.html.txt.tmx
Source language: en
Languages: ga

source: Health services for people with disabilities
ga: Seirbhísí sláinte do dhaoine faoi mhíchumas

source: The Health Service Executive (HSE) provides a range of services for people with intellectual, physical and sensory disabilities or autism
ga: Cuireann Feidhmeannacht na Seirbhíse Sláinte (FSS) réimse seirbhísí ar fáil do dhaoine faoi mhíchumas intleachtúil, fisiciúil agus le míchumas céadfaíoch nó le huathachas

source: These services include basic health services as well as assessment, rehabilitation, income maintenance, community care and residential care
ga: Tá bunsheirbhísí sláinte i gceist leis na seirbhísí seo chomh maith le measúnú, athshlánú, cothú ioncaim, cúram pobail agus cúram cónaithe

source: Some services are provided directly by the HSE
ga: Cuireann an FSS seirbhísí áirithe ar fáil go díreach

source: Many of the community, residential and rehabilitative training services are provided by voluntary organisations with grant aid from the HSE
ga: Tá roinnt seirbhísí soláthar ag eagraíochtaí nó ag grúpaí deonacha thar ceann FSS

source: The level of service varies considerably throughout the country
ga: Is mór an difríocht idir leibhéal na seirbhísí atá ar fáil ar fud na tíre

source: HSE Administrative Areas have appointed Disability Services Managers to co-ordinate the delivery of services to people with disabilities
ga: Tá Bainisteoirí Sheirbhísí Míchumais ceapaithe ag na (FSS) Limistéar le comhordnú a dhéanamh ar sholáthar seirbhísí do dhaoine faoi mhíchumas

source: People with disabilities are entitled to general health services on the same basis as everyone else
ga: Tá daoine faoi mhíchumas i dteideal seirbhísí ginearálta sláinte ar an mbunús céanna le gach duine eile

source: • Prescribed drugs, medicines, medical aids and appliances
ga: • Drugaí, cógais, áiseanna leighis agus gléasanna ordaithe

source: • Dental services, optical services and aural services
ga: • Seirbhísí fiaclóireachta, seirbhísí súl agus seirbhísí oftalmacha agus seirbhísí cluastuisceana

source: People with disabilities are entitled to avail of the range of community care services
ga: Tá daoine faoi mhíchumas i dteideal fáil a bheith acu ar réimse seirbhísí cúram pobail

source: In many cases, they have priority in access to the services
ga: I go leor cásanna bíonn túsáite acu do na seirbhísí seo

source: People with disabilities who are unable to live at home may be provided with residential services directly by the HSE or, on its behalf, by voluntary organisations that are funded by the HSE
ga: Féadfaidh FSS, nó eagraíochtaí deonacha, thar a cheann, atá cistithe ag FSS seirbhísí cónaithe a sholáthar go díreach do dhaoine faoi mhíchumas nach bhfuil ar a gcumas cónaí sa bhaile

source: A residential service is where someone lives most or all of the time. Long stay charges may apply
ga: Is ionann seirbhís chónaithe agus áit ina gcónaíonn duine an chuid is mó den am nó an t-am go léir

source: The HSE has appointed an independent Confidential Recipient to whom anyone can make a complaint or raise concerns about the care and treatment of any vulnerable person receiving residential care that is funded by the HSE
ga: Cheap FSS Faighteoir Rúnda neamhspleách ar féidir le duine ar bith gearán a dhéanamh leis nó buarthaí a thabhairt chun solais leis faoi chúram agus cóireáil aon duine leochailigh a gcuirtear cúram cónaithe ar fáil dó/di atá cistithe ag FSS

source: The Health Information and Quality Authority (HIQA) regulates all residential services for children and adults with disabilities, whether provided by the HSE, voluntary groups or private organisations
ga: Rialaíonn an tÚdarás um Fhaisnéis agus Cáilíocht Sláinte (HIQA) gach seirbhís chónaithe do leanaí agus daoine fásta atá faoi mhíchumas, cé acu má sholáthraíonn FSS, grúpaí deonacha nó eagraíochtaí príobháideacha iad

source: • Institutions, which usually provide accommodation for 10 or more people
ga: • Institiúidí, ar gnách dóibh cóiríocht a sholáthar do 10 nduine nó níos mó

source: • Clustered housing, or housing associated with an institution (it may be on the grounds of or near the institution)
ga: • Tithíocht bhraislithe, nó tithíocht a bhaineann le hinstitiúid (d’fhéadfadh sé a bheith suite ar thalamh na hinstitiúide nó i ngar di)

source: • Supported community living, which is houses within an ordinary neighbourhood that may have supports for the people with disabilities living there
ga: • Maireachtáil sa Phobal lena dtacaítear, arb ionann é agus tithe atá suite laistigh de ghnáthchomharsanacht a d’fhéadfadh tacaíochtaí a sholáthar do dhaoine faoi mhíchumas a chónaíonn ann

source: HIQA has set National Standards for Residential Services for Children and Adults with Disabilities
ga: Rinne HIQA Caighdeáin Náisiúnta um Sheirbhísí Cónaithe do Leanaí agus Daoine Fásta faoi Mhíchumas a leagan amach

source: It is responsible for registering, inspecting and monitoring residential services
ga: Tá sé freagrach as seirbhísí cónaithe a chlárú, a iniúchadh agus a mhonatóiriú

source: HIQA does not have the legal power to investigate individual complaints but it does have a process for raising concerns about a service and it examines any information it receives
ga: Níl an chumhacht dhlíthiúil ag HIQA chun gearáin aonair a fhiosrú, ach tá próiseas aige chun buarthaí a thabhairt chun solais faoi sheirbhís agus scrúdaíonn sé aon fhaisnéis a fhaigheann sé

source: Healthcomplaints.ie has more information about raising concerns about residential services
ga: Tá níos mó faisnéise ar Healthcomplaints.ie faoi bhuarthaí a thabhairt chun solais faoi sheirbhísí cónaithe

source: For more information on the range of supports available for people with disabilities, in health and other areas, see the Guide to entitlements for people with disabilities (pdf)
ga: Chun teacht ar bhreis faisnéise ar an réimse tacaíochtaí atá ar fáil do dhaoine faoi mhíchumas, i limistéar na sláinte agus i limistéir eile, féach An treoir maidir le teidlíochtaí do dhaoine faoi mhíchumas (pdf)
